"""
@Author:Fallen
@File:stereoconfig_040_2.py
@Time:2021/10/11 2:03
"""
import numpy as np
# import cv2


# 双目相机参数
class stereoCamera(object):
    def __init__(self):
        # camera par = np.array([[ax,s,px],[0,ay,py],[0,0,1]
        # 左相机内参
        # s is not absolutely 0
        self.cam_matrix_left = np.array([[909.86671, 0, 660.20921],
                                         [0, 911.79263, 366.97540],
                                         [0, 0, 1]
                                         ])
        # 右相机内参
        self.cam_matrix_right = np.array([[910.28677, 0, 643.13089],
                                          [0, 911.75736, 368.80181],
                                          [0, 0, 1]
                                          ])

        # 左右相机畸变系数:[k1, k2, p1, p2, k3]
        # kc_left = [0.03522 - 0.05553 - 0.00060   0.00100  0.00000]
        # kc_right = [ 0.04428   -0.07831   -0.00027   0.00093  0.00000 ]
        self.distortion_l = np.array([[0.03522, -0.05553, -0.00060, 0.00100, 0.00000]])
        self.distortion_r = np.array([[0.04428, -0.07831, -0.00027, 0.00093, 0.00000]])

        # 旋转矩阵
        # matrix = cv2.Rodrigues(vector)
        # om = [0.00322, 0.01106, 0.00204]
        # [ 0.99993676, -0.00202215,  0.01106303],
        # [ 0.00205776,  0.99999274, -0.00320865],
        # [-0.01105646,  0.00323121,  0.99993365]
        self.R = np.array([[0.99993676, -0.00202215,  0.01106303],
                           [0.00205776,  0.99999274, -0.00320865],
                           [0.01105646,  0.00323121,  0.99993365]
                           ])

        # 平移矩阵
        self.T = np.array([[-51.53642], [0.29424], [0.19123]])

        # 焦距
        self.focal_length = (909.86671 + 911.79263)/2  # 默认值，一般取立体校正后的重投影矩阵Q中的 Q[2,3]

        # 基线距离
        self.baseline = 51.53642  # 单位：mm， 为平移向量的第一个参数（取绝对值）
